MiEcosystem/mijia_ble/demos/NXP_QN908X/mible_std_authen/NXP_QN908X/bm/pin_mux.h
/* FC2_SDA_MOSI (number 7), U21[11]/U15[5]/J5[13]/J8[2]/QN_PA04_MOSI */
#define BOARD_PMOD_MOSI_PERIPHERAL                                     FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_PMOD_MOSI_SIGNAL                                          SDA_MOSI   /*!< FLEXCOMM2 signal: SDA_MOSI */
#define BOARD_PMOD_MOSI_PIN_NAME                                    FC2_SDA_MOSI   /*!< Pin name */
#define BOARD_PMOD_MOSI_LABEL         "U21[11]/U15[5]/J5[13]/J8[2]/QN_PA04_MOSI"   /*!< Label */
#define BOARD_PMOD_MOSI_NAME                                         "PMOD_MOSI"   /*!< Identifier name */

/* FC2_SDA_SSEL0 (number 8), U21[12]/U15[1]/J5[15]/J8[1]/QN_PA03_SSEL */
#define BOARD_PMOD_SSEL_PERIPHERAL                                     FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_PMOD_SSEL_SIGNAL                                         SDA_SSEL0   /*!< FLEXCOMM2 signal: SDA_SSEL0 */
#define BOARD_PMOD_SSEL_PIN_NAME                                   FC2_SDA_SSEL0   /*!< Pin name */
#define BOARD_PMOD_SSEL_LABEL         "U21[12]/U15[1]/J5[15]/J8[1]/QN_PA03_SSEL"   /*!< Label */
#define BOARD_PMOD_SSEL_NAME                                         "PMOD_SSEL"   /*!< Identifier name */

/* FC2_SCK (number 15), U21[18]/U15[6]/J5[9]/J8[4]/QN_PA30_TRACE_D3/SCK */
#define BOARD_PMOD_FC2_SCK_PERIPHERAL                                  FLEXCOMM2   /*!< Device name: FLEXCOMM2 */
#define BOARD_PMOD_FC2_SCK_SIGNAL                                            SCK   /*!< FLEXCOMM2 signal: SCK */
#define BOARD_PMOD_FC2_SCK_PIN_NAME                                      FC2_SCK   /*!< Pin name */
#define BOARD_PMOD_FC2_SCK_LABEL "U21[18]/U15[6]/J5[9]/J8[4]/QN_PA30_TRACE_D3/SCK" /*!< Label */
#define BOARD_PMOD_FC2_SCK_NAME                                   "PMOD_FC2_SCK"   /*!< Identifier name */

/* GPIOB2 (number 33), U21[36]/J7[10]/J8[7]/QN_PB02 */
#define BOARD_PMOD_PB02_PERIPHERAL                                         GPIOB   /*!< Device name: GPIOB */
#define BOARD_PMOD_PB02_SIGNAL                                             GPIOB   /*!< GPIOB signal: GPIOB */
#define BOARD_PMOD_PB02_CHANNEL                                                2   /*!< GPIOB GPIOB channel: 2 */
#define BOARD_PMOD_PB02_PIN_NAME                                          GPIOB2   /*!< Pin name */
#define BOARD_PMOD_PB02_LABEL                     "U21[36]/J7[10]/J8[7]/QN_PB02"   /*!< Label */
#define BOARD_PMOD_PB02_NAME                                         "PMOD_PB02"   /*!< Identifier name */

/* FC3_SCK (number 12), U21[17]/U26[2]/J8[8]/J7[20]/U3[12]/QN_PA31_TDO_SWO/LED */
#define BOARD_PMOD_FC3_SCK_PERIPHERAL                                  FLEXCOMM3   /*!< Device name: FLEXCOMM3 */
#define BOARD_PMOD_FC3_SCK_SIGNAL                                            SCK   /*!< FLEXCOMM3 signal: SCK */
#define BOARD_PMOD_FC3_SCK_PIN_NAME                                      FC3_SCK   /*!< Pin name */
#define BOARD_PMOD_FC3_SCK_LABEL "U21[17]/U26[2]/J8[8]/J7[20]/U3[12]/QN_PA31_TDO_SWO/LED" /*!< Label */
#define BOARD_PMOD_FC3_SCK_NAME                                   "PMOD_FC3_SCK"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPMod_SPI_I2C(void);

/* SWCLK (number 23), U21[26]/J5[16]/U3[4]/QN_PA22_TCK_SWDCLK */
#define BOARD_SWCLK_PERIPHERAL                                               SWD   /*!< Device name: SWD */
#define BOARD_SWCLK_SIGNAL                                                 SWCLK   /*!< SWD signal: SWCLK */
#define BOARD_SWCLK_PIN_NAME                                               SWCLK   /*!< Pin name */
#define BOARD_SWCLK_LABEL              "U21[26]/J5[16]/U3[4]/QN_PA22_TCK_SWDCLK"   /*!< Label */
#define BOARD_SWCLK_NAME                                                 "SWCLK"   /*!< Identifier name */

/* SWDIO (number 22), U21[25]/J5[18]/U5[4]/QN_PA23_TMS_SWDIO */
#define BOARD_SWDIO_PERIPHERAL                                               SWD   /*!< Device name: SWD */
#define BOARD_SWDIO_SIGNAL                                                 SWDIO   /*!< SWD signal: SWDIO */
#define BOARD_SWDIO_PIN_NAME                                               SWDIO   /*!< Pin name */
#define BOARD_SWDIO_LABEL               "U21[25]/J5[18]/U5[4]/QN_PA23_TMS_SWDIO"   /*!< Label */
#define BOARD_SWDIO_NAME                                                 "SWDIO"   /*!< Identifier name */

/* SWO (number 12), U21[17]/U26[2]/J8[8]/J7[20]/U3[12]/QN_PA31_TDO_SWO/LED */
#define BOARD_SWO_PERIPHERAL                                                 SWD   /*!< Device name: SWD */
#define BOARD_SWO_SIGNAL                                                     SWO   /*!< SWD signal: SWO */
#define BOARD_SWO_PIN_NAME                                                   SWO   /*!< Pin name */
#define BOARD_SWO_LABEL "U21[17]/U26[2]/J8[8]/J7[20]/U3[12]/QN_PA31_TDO_SWO/LED"   /*!< Label */
#define BOARD_SWO_NAME                                                     "SWO"   /*!< Identifier name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSWD_DEBUG(void);

/* ETM_TRACEDAT2 (number 16), U21[19]/J7[9]/U23[6]/QN_PA29_TRACE_D2/PWM7 */
#define BOARD_ETM_TRACEDAT2_PERIPHERAL                                       ETM   /*!< Device name: ETM */
#define BOARD_ETM_TRACEDAT2_SIGNAL                                 ETM_TRACEDATA   /*!< ETM signal: ETM_TRACEDATA */
#define BOARD_ETM_TRACEDAT2_CHANNEL                                            2   /*!< ETM ETM_TRACEDATA channel: 2 */
#define BOARD_ETM_TRACEDAT2_PIN_NAME                               ETM_TRACEDAT2   /*!< Pin name */
#define BOARD_ETM_TRACEDAT2_LABEL   "U21[19]/J7[9]/U23[6]/QN_PA29_TRACE_D2/PWM7"   /*!< Label */
#define BOARD_ETM_TRACEDAT2_NAME                                 "ETM_TRACEDAT2"   /*!< Identifier name */

/* ETM_TRACECLK (number 17), U21[20]/J7[18]/U24[4]/QN_PA28_TRACE_CLK */
#define BOARD_ETM_TRACECLK_PERIPHERAL                                        ETM   /*!< Device name: ETM */
#define BOARD_ETM_TRACECLK_SIGNAL                                   ETM_TRACECLK   /*!< ETM signal: ETM_TRACECLK */
#define BOARD_ETM_TRACECLK_PIN_NAME                                 ETM_TRACECLK   /*!< Pin name */
#define BOARD_ETM_TRACECLK_LABEL       "U21[20]/J7[18]/U24[4]/QN_PA28_TRACE_CLK"   /*!< Label */
#define BOARD_ETM_TRACECLK_NAME                                   "ETM_TRACECLK"   /*!< Identifier name */

/* ETM_TRACEDAT3 (number 15), U21[18]/U15[6]/J5[9]/J8[4]/QN_PA30_TRACE_D3/SCK */
#define BOARD_ETM_TRACEDAT3_PERIPHERAL                                       ETM   /*!< Device name: ETM */
#define BOARD_ETM_TRACEDAT3_SIGNAL                                 ETM_TRACEDATA   /*!< ETM signal: ETM_TRACEDATA */
#define BOARD_ETM_TRACEDAT3_CHANNEL                                            3   /*!< ETM ETM_TRACEDATA channel: 3 */
#define BOARD_ETM_TRACEDAT3_PIN_NAME                               ETM_TRACEDAT3   /*!< Pin name */
#define BOARD_ETM_TRACEDAT3_LABEL "U21[18]/U15[6]/J5[9]/J8[4]/QN_PA30_TRACE_D3/SCK" /*!< Label */
#define BOARD_ETM_TRACEDAT3_NAME                                 "ETM_TRACEDAT3"   /*!< Identifier name */

